# === Common ===
success=Th\u00E0nh c\u00F4ng
failure=Th\u1EA5t b\u1EA1i

# === Auth ===
auth.login.invalid=T\u00EAn \u0111\u0103ng nh\u1EADp ho\u1EB7c m\u1EADt kh\u1EA9u kh\u00F4ng h\u1EE3p l\u1EC7.
auth.user.inactive=T\u00E0i kho\u1EA3n \u0111\u00E3 b\u1ECB v\u00F4 hi\u1EC7u h\u00F3a.
auth.unauthorized=Kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp
auth.token.expired=Phi\u00EAn \u0111\u0103ng nh\u1EADp \u0111\u00E3 h\u1EBFt h\u1EA1n
auth.refresh.token.invalid=Token l\u00E0m m\u1EDBi kh\u00F4ng h\u1EE3p l\u1EC7 ho\u1EB7c \u0111\u00E3 h\u1EBFt h\u1EA1n
auth.refresh.token.not.refresh=Token cung c\u1EA5p kh\u00F4ng ph\u1EA3i l\u00E0 refresh token
auth.refresh.token.invalid.id=Refresh token kh\u00F4ng h\u1EE3p l\u1EC7
auth.refresh.token.not.found=Refresh token kh\u00F4ng t\u00ECm th\u1EA5y ho\u1EB7c kh\u00F4ng h\u1EE3p l\u1EC7
auth.user.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u01B0\u1EDDi d\u00F9ng
auth.email.already.in.use=Email \u0111\u00E3 \u0111\u01B0\u1EE3c s\u1EED d\u1EE5ng
auth.account.not.active=T\u00E0i kho\u1EA3n ch\u01B0a \u0111\u01B0\u1EE3c k\u00EDch ho\u1EA1t
auth.reset.token.invalid=Token \u0111\u1EB7t l\u1EA1i m\u1EADt kh\u1EA9u kh\u00F4ng h\u1EE3p l\u1EC7 ho\u1EB7c \u0111\u00E3 h\u1EBFt h\u1EA1n
auth.forgot.password.success=N\u1EBFu email t\u1ED3n t\u1EA1i, li\u00EAn k\u1EBFt \u0111\u1EB7t l\u1EA1i m\u1EADt kh\u1EA9u \u0111\u00E3 \u0111\u01B0\u1EE3c g\u1EEDi \u0111\u1EBFn \u0111\u1ECBa ch\u1EC9 email c\u1EE7a b\u1EA1n.
auth.reset.password.success=M\u1EADt kh\u1EA9u \u0111\u00E3 \u0111\u01B0\u1EE3c \u0111\u1EB7t l\u1EA1i th\u00E0nh c\u00F4ng. B\u1EA1n c\u00F3 th\u1EC3 \u0111\u0103ng nh\u1EADp v\u1EDBi m\u1EADt kh\u1EA9u m\u1EDBi.
auth.logout.success=\u0110\u0103ng xu\u1EA5t th\u00E0nh c\u00F4ng

# === User ===
user.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u01B0\u1EDDi d\u00F9ng v\u1EDBi id: {0}
user.not.found.email=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u01B0\u1EDDi d\u00F9ng v\u1EDBi email: {0}
user.email.exists=Ng\u01B0\u1EDDi d\u00F9ng v\u1EDBi email ''{0}'' \u0111\u00E3 t\u1ED3n t\u1EA1i
user.identity.card.exists=Ng\u01B0\u1EDDi d\u00F9ng v\u1EDBi CMND/CCCD ''{0}'' \u0111\u00E3 t\u1ED3n t\u1EA1i

# === Project ===
project.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y d\u1EF1 \u00E1n v\u1EDBi id: {0}
project.name.exists=D\u1EF1 \u00E1n v\u1EDBi t\u00EAn ''{0}'' \u0111\u00E3 t\u1ED3n t\u1EA1i
project.already.deleted=D\u1EF1 \u00E1n \u0111\u00E3 b\u1ECB x\u00F3a
project.cannot.update.deleted=Kh\u00F4ng th\u1EC3 c\u1EADp nh\u1EADt d\u1EF1 \u00E1n \u0111\u00E3 x\u00F3a
project.manager.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y qu\u1EA3n l\u00FD d\u1EF1 \u00E1n v\u1EDBi id: {0}
project.member.ids.invalid=M\u1ED9t s\u1ED1 ID th\u00E0nh vi\u00EAn kh\u00F4ng h\u1EE3p l\u1EC7
project.date.format.invalid=\u0110\u1ECBnh d\u1EA1ng ng\u00E0y kh\u00F4ng h\u1EE3p l\u1EC7. \u0110\u1ECBnh d\u1EA1ng mong \u0111\u1EE3i: dd/MM/yyyy

# === Timesheet ===
timesheet.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y b\u1EA3ng ch\u1EA5m c\u00F4ng v\u1EDBi id: {0}
timesheet.cannot.update=Kh\u00F4ng th\u1EC3 c\u1EADp nh\u1EADt b\u1EA3ng ch\u1EA5m c\u00F4ng
timesheet.cannot.change.status=Kh\u00F4ng th\u1EC3 thay \u0111\u1ED5i tr\u1EA1ng th\u00E1i b\u1EA3ng ch\u1EA5m c\u00F4ng
timesheet.cannot.log=Kh\u00F4ng th\u1EC3 ch\u1EA5m c\u00F4ng, t\u1ED5ng s\u1ED1 gi\u1EDD l\u00E0m vi\u1EC7c b\u00ECnh th\u01B0\u1EDDng kh\u00F4ng \u0111\u01B0\u1EE3c l\u1EDBn h\u01A1n {0}
timesheet.cannot.log.weekend=Kh\u00F4ng th\u1EC3 ch\u1EA5m c\u00F4ng v\u00E0o cu\u1ED1i tu\u1EA7n
timesheet.cannot.log.full.dayoff=Kh\u00F4ng th\u1EC3 ch\u1EA5m c\u00F4ng v\u00E0o ng\u00E0y ngh\u1EC9 tr\u1ECDn ng\u00E0y
timesheet.status.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y tr\u1EA1ng th\u00E1i

# === Day Off ===
dayoff.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y y\u00EAu c\u1EA7u ngh\u1EC9 ph\u00E9p
dayoff.already.processed=Y\u00EAu c\u1EA7u ngh\u1EC9 ph\u00E9p \u0111\u00E3 \u0111\u01B0\u1EE3c x\u1EED l\u00FD
dayoff.end.after.start=Th\u1EDDi gian k\u1EBFt th\u00FAc ph\u1EA3i sau th\u1EDDi gian b\u1EAFt \u0111\u1EA7u
dayoff.overlap.weekend=Ng\u00E0y ngh\u1EC9 kh\u00F4ng \u0111\u01B0\u1EE3c tr\u00F9ng v\u1EDBi cu\u1ED1i tu\u1EA7n
dayoff.overlap.existing=Y\u00EAu c\u1EA7u ngh\u1EC9 ph\u00E9p tr\u00F9ng v\u1EDBi y\u00EAu c\u1EA7u \u0111\u00E3 c\u00F3

# === Validation ===
validation.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y {0}.
validation.already.exists={0} \u0111\u00E3 t\u1ED3n t\u1EA1i.
validation.not.blank={0} kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng.
validation.not.null={0} kh\u00F4ng \u0111\u01B0\u1EE3c null.
validation.overlapping.date=Kho\u1EA3ng th\u1EDDi gian b\u1ECB tr\u00F9ng l\u1EB7p
validation.from.date.to.date=Ng\u00E0y b\u1EAFt \u0111\u1EA7u ph\u1EA3i nh\u1ECF h\u01A1n ng\u00E0y k\u1EBFt th\u00FAc

# === Generic ===
error.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y {0}.
error.user.not.in.project=B\u1EA1n kh\u00F4ng thu\u1ED9c d\u1EF1 \u00E1n n\u00E0y
error.cannot.update.another.project=Kh\u00F4ng th\u1EC3 c\u1EADp nh\u1EADt d\u1EF1 \u00E1n kh\u00E1c
